# Exploratory Data Analysis in SQL

- Learning how to explore PostgreSQL databases and d analyzing the data in them.
- Using data from Stack Overflow, Fortune 500 companies, and 311 help requests from Evanston, IL, 
- Get familiar with numeric, character, and date/time data types. 
- Use functions to aggregate, summarize, and analyze data without leaving the database. 
- Learn common problems to look for and strategies to clean up messy data.

In [54]:
import pandas as pd
import sqlalchemy
import psycopg2
from sqlalchemy.engine import create_engine
engine = create_engine('postgresql://postgres:***@localhost:5432/database', paramstyle='format') 

#df  = pd.read_csv('actors_181127_2.csv')
#df1 = pd.read_csv('')
#df.to_sql("Fortune500", engine)
#df1.to_sql("stackoverflow", engine)
%reload_ext sql
%sql postgresql://postgres:***@localhost:5432/database

In [2]:
#connect to the database
conn = psycopg2.connect(host='localhost',
                       dbname='database',
                       user='postgres',
                       password='***',
                       port='5432')  
cursor = conn.cursor()
#cursor.execute("SELECT name FROM database WHERE type = 'table'").fetchall()

In [3]:
cursor.execute("""SELECT table_name FROM information_schema.tables WHERE table_schema = 'public'""")
for table in cursor.fetchall():
    print(table)

('evanston311',)
('stackoverflow',)
('Fortune500',)

In [5]:
%%sql

SELECT table_name
FROM information_schema.tables
WHERE table_schema = 'public'
ORDER BY table_name;

 * postgresql://postgres:***@localhost:5432/database
3 rows affected.

[('evanston311',), ('Fortune500',), ('stackoverflow',)]

In [6]:
%%sql 
SELECT * FROM "Fortune500"
Limit 5;

 * postgresql://postgres:***@localhost:5432/database
5 rows affected.

[(0, 1, 'Walmart', 'Wal-Mart Stores, Inc.', 'WMT', 'http://www.walmart.com', 'Bentonville, AR', 'Retailing', 'General Merchandisers', 2300000, 485873.0, 0.8, 13643.0, -7.2, 198825, 77798.0),
 (1, 2, 'Berkshire Hathaway', 'Berkshire Hathaway Inc.', 'BRKA', 'http://www.berkshirehathaway.com', 'Omaha, NE', 'Financials', 'Insurance: Property and Casualty (Stock)', 367700, 223604.0, 6.1, 24074.0, 0.0, 620854, 283001.0),
 (2, 3, 'Apple', 'Apple, Inc.', 'AAPL', 'http://www.apple.com', 'Cupertino, CA', 'Technology', 'Computers, Office Equipment', 116000, 215639.0, -7.7, 45687.0, -14.4, 321686, 128249.0),
 (3, 4, 'Exxon Mobil', 'Exxon Mobil Corporation', 'XOM', 'http://www.exxonmobil.com', 'Irving, TX', 'Energy', 'Petroleum Refining', 72700, 205004.0, -16.7, 7840.0, -51.5, 330314, 167325.0),
 (4, 5, 'McKesson', 'McKesson Corporation', 'MCK', 'http://www.mckesson.com', 'San Francisco, CA', 'Wholesalers', 'Wholesalers: Health Care', 68000, 192487.0, 6.2, 2258.0, 53.0, 56563, 8924.0)]

In [7]:
%%sql

SELECT sector, 
       avg(revenues/employees::numeric) AS avg_rev_employee
       
FROM "Fortune500"
GROUP BY sector
ORDER BY avg_rev_employee;

 * postgresql://postgres:***@localhost:5432/database
21 rows affected.

[('Hotels, Restaurants & Leisure', 0.0949871815105681),
 ('Apparel', 0.278659429766801),
 ('Food & Drug Stores', 0.307999504100602),
 ('Motor Vehicles & Parts', 0.342527124246595),
 ('Household Products', 0.355573389695953),
 ('Retailing', 0.360194560920781),
 ('Industrials', 0.361485433761463),
 ('Aerospace & Defense', 0.366714992486283),
 ('Transportation', 0.403653524773296),
 ('Business Services', 0.420109942101666),
 ('Technology', 0.573118476933598),
 ('Chemicals', 0.595499766580745),
 ('Telecommunications', 0.629589972791875),
 ('Health Care', 0.790532869196815),
 ('Media', 0.795618665654632),
 ('Food, Beverages & Tobacco', 0.830884759392498),
 ('Engineering & Construction', 0.861163766738748),
 ('Wholesalers', 1.41324581189371),
 ('Financials', 1.72638470140973),
 ('Energy', 1.82601423325242),
 ('Materials', 4.75758351554488)]

## Explore with division

In [8]:
%%sql
select * from "stackoverflow" limit 10;

 * postgresql://postgres:***@localhost:5432/database
10 rows affected.

[(0, 'paypal', '2018-09-25', 18050, 0.001093757, 8402, 0.001751857),
 (1, 'amazon-elb', '2018-09-25', 1452, 8.8e-05, 561, 0.000116972),
 (2, 'amazon-mws', '2018-09-25', 706, 4.28e-05, 278, 5.8e-05),
 (3, 'amazon-swf', '2018-09-25', 232, 1.41e-05, 77, 1.61e-05),
 (4, 'amazon-sns', '2018-09-25', 1400, 8.48e-05, 601, 0.000125312),
 (5, 'excel', '2018-09-25', 177603, 0.010762031, 61804, 0.012886449),
 (6, 'mongodb', '2018-09-25', 104159, 0.00631162, 36543, 0.007619406),
 (7, 'amazon-glacier', '2018-09-25', 192, 1.16e-05, 59, 1.23e-05),
 (8, 'amazon-route53', '2018-09-25', 1098, 6.65e-05, 389, 8.11e-05),
 (9, 'dropbox', '2018-09-25', 3071, 0.000186091, 1169, 0.000243743)]

In [9]:
%%sql
-- Divide unanswered_count by question_count
SELECT unanswered_count/question_count::numeric AS computed_pct, 
       -- What are you comparing the above quantity to?
       unanswered_pct
FROM "stackoverflow"
 -- Select rows where question_count is not 0
WHERE question_count != 0
 LIMIT 10;

 * postgresql://postgres:***@localhost:5432/database
10 rows affected.

[(Decimal('0.46548476454293628809'), 0.001751857),
 (Decimal('0.38636363636363636364'), 0.000116972),
 (Decimal('0.39376770538243626062'), 5.8e-05),
 (Decimal('0.33189655172413793103'), 1.61e-05),
 (Decimal('0.42928571428571428571'), 0.000125312),
 (Decimal('0.34798961729250068974'), 0.012886449),
 (Decimal('0.35083862172255878033'), 0.007619406),
 (Decimal('0.30729166666666666667'), 1.23e-05),
 (Decimal('0.35428051001821493625'), 8.11e-05),
 (Decimal('0.38065776619993487463'), 0.000243743)]

In [10]:
%%sql
-- Select sector and summary measures of fortune500 profits
SELECT sector,
       min(profits),
       max(profits),
       avg(profits),
       stddev(profits)    
 FROM "Fortune500"
 -- What to group by?
 GROUP BY sector
 -- Order by the average profits
 ORDER BY avg;

 * postgresql://postgres:***@localhost:5432/database
21 rows affected.

[('Energy', -6177.0, 7840.0, 10.4446428571428, 2264.57214292595),
 ('Materials', -440.0, 1027.0, 272.468421052632, 406.632781447055),
 ('Engineering & Construction', 15.0, 911.8, 390.169230769231, 277.66512019762),
 ('Wholesalers', -199.4, 2258.0, 391.279310344828, 532.171183776766),
 ('Retailing', -2221.0, 13643.0, 991.785106382978, 2348.34255907722),
 ('Chemicals', -3.9, 4318.0, 1137.02142857143, 1129.75230449223),
 ('Business Services', 57.2, 5991.0, 1155.355, 1454.3606869922),
 ('Food & Drug Stores', -502.2, 4173.0, 1217.42857142857, 1613.04144885192),
 ('Apparel', 396.0, 3760.0, 1263.7, 1419.13457078601),
 ('Hotels, Restaurants & Leisure', 348.0, 4686.5, 1451.06, 1372.97573273043),
 ('Household Products', -198.8, 10508.0, 1650.30833333333, 2900.1168050014),
 ('Transportation', 69.0, 4373.0, 1670.29411764706, 1373.01316065733),
 ('Industrials', -176.1, 8831.0, 1727.68947368421, 2326.0182510736),
 ('Media', -495.9, 9391.0, 1821.33636363636, 2839.29947813637),
 ('Motor Vehicles & Parts', -674.9, 9427.0, 1919.53333333333, 3176.30073198367),
 ('Aerospace & Defense', -941.0, 5302.0, 2093.30833333333, 2064.77995193779),
 ('Food, Beverages & Tobacco', -677.0, 14239.0, 2346.18333333333, 3412.35215633448),
 ('Financials', -1128.0, 24733.0, 2719.77619047619, 5064.76407085288),
 ('Health Care', -1721.0, 16540.0, 2773.26052631579, 3751.81879608677),
 ('Telecommunications', -383.5, 13127.0, 4127.28, 5400.73173268627),
 ('Technology', -1672.0, 45687.0, 4137.24186046512, 8042.98336360667)]

In [11]:
%%sql
-- Select sector and summary measures of fortune500 profits
SELECT sector,
       min(profits),
       max(profits),
      avg(profits),
       stddev(profits)
       
  FROM "Fortune500"
 -- What to group by?
 GROUP BY sector
 -- Order by the average profits
 ORDER BY avg;

 * postgresql://postgres:***@localhost:5432/database
21 rows affected.

[('Energy', -6177.0, 7840.0, 10.4446428571428, 2264.57214292595),
 ('Materials', -440.0, 1027.0, 272.468421052632, 406.632781447055),
 ('Engineering & Construction', 15.0, 911.8, 390.169230769231, 277.66512019762),
 ('Wholesalers', -199.4, 2258.0, 391.279310344828, 532.171183776766),
 ('Retailing', -2221.0, 13643.0, 991.785106382978, 2348.34255907722),
 ('Chemicals', -3.9, 4318.0, 1137.02142857143, 1129.75230449223),
 ('Business Services', 57.2, 5991.0, 1155.355, 1454.3606869922),
 ('Food & Drug Stores', -502.2, 4173.0, 1217.42857142857, 1613.04144885192),
 ('Apparel', 396.0, 3760.0, 1263.7, 1419.13457078601),
 ('Hotels, Restaurants & Leisure', 348.0, 4686.5, 1451.06, 1372.97573273043),
 ('Household Products', -198.8, 10508.0, 1650.30833333333, 2900.1168050014),
 ('Transportation', 69.0, 4373.0, 1670.29411764706, 1373.01316065733),
 ('Industrials', -176.1, 8831.0, 1727.68947368421, 2326.0182510736),
 ('Media', -495.9, 9391.0, 1821.33636363636, 2839.29947813637),
 ('Motor Vehicles & Parts', -674.9, 9427.0, 1919.53333333333, 3176.30073198367),
 ('Aerospace & Defense', -941.0, 5302.0, 2093.30833333333, 2064.77995193779),
 ('Food, Beverages & Tobacco', -677.0, 14239.0, 2346.18333333333, 3412.35215633448),
 ('Financials', -1128.0, 24733.0, 2719.77619047619, 5064.76407085288),
 ('Health Care', -1721.0, 16540.0, 2773.26052631579, 3751.81879608677),
 ('Telecommunications', -383.5, 13127.0, 4127.28, 5400.73173268627),
 ('Technology', -1672.0, 45687.0, 4137.24186046512, 8042.98336360667)]

## Summarize group statistics

Sometimes you want to understand how a value varies across groups. For example, how does the maximum value per group vary across groups?

To find out, first summarize by group, and then compute summary statistics of the group results. One way to do this is to compute group values in a subquery, and then summarize the results of the subquery.

For this exercise, what is the standard deviation across tags in the maximum number of Stack Overflow questions per day? What about the mean, min, and max of the maximums as well?

In [12]:
%%sql
-- Compute standard deviation of maximum values
SELECT stddev(maxval),
       -- min
       min(maxval),
       -- max
       max(maxval),
       -- avg
       avg(maxval)
  -- Subquery to compute max of question_count by tag
  FROM (SELECT max(question_count) AS maxval
          FROM stackoverflow
         -- Compute max by...
         GROUP BY tag) AS max_results; -- alias for subquery

 * postgresql://postgres:***@localhost:5432/database
1 rows affected.

[(Decimal('176458.37952720'), 30, 1138658, Decimal('52652.433962264151'))]

## Exploring 
### Truncate

In [13]:
%%sql
select count(*),
        name 
from "Fortune500" 
group by name
limit 10;

 * postgresql://postgres:***@localhost:5432/database
10 rows affected.

[(1, 'Darden Restaurants, Inc.'),
 (1, 'Bed Bath & Beyond Inc.'),
 (1, 'Simon Property Group, Inc.'),
 (1, 'Intercontinental Exchange, Inc.'),
 (1, 'Corning Incorporated'),
 (1, 'Kellogg Company'),
 (1, 'Centene Corporation'),
 (1, 'Bank of America Corporation'),
 (1, 'ONEOK, Inc.'),
 (1, 'Gilead Sciences, Inc.')]

In [14]:
%%sql
SELECT  trunc(employees, -4) AS employee_bin,
        count(name)
FROM "Fortune500"
 -- Limit to which companies?
WHERE employees<100000
 -- Use alias to group
GROUP BY employee_bin
 -- Use alias to order
ORDER BY employee_bin;

 * postgresql://postgres:***@localhost:5432/database
10 rows affected.

[(Decimal('0'), 102),
 (Decimal('10000'), 108),
 (Decimal('20000'), 63),
 (Decimal('30000'), 42),
 (Decimal('40000'), 35),
 (Decimal('50000'), 31),
 (Decimal('60000'), 18),
 (Decimal('70000'), 18),
 (Decimal('80000'), 6),
 (Decimal('90000'), 10)]

### Generate series

`generate_series(from, to, step)`

Ex:Summarize the distribution of the number of questions with the tag "dropbox" on Stack Overflow per day by binning the data.

In [15]:
%%sql
-- Select the min and max of question_count
SELECT max(question_count), 
       min(question_count)
  -- From what table?
  FROM "stackoverflow"
 -- For tag dropbox
 WHERE tag = 'dropbox';

 * postgresql://postgres:***@localhost:5432/database
1 rows affected.

[(3072, 2315)]

In [16]:
%%sql
-- Create lower and upper bounds of bins
SELECT generate_series(2200 , 3050, 50) AS lower,
       generate_series(2250 , 3100, 50) AS upper;

 * postgresql://postgres:***@localhost:5432/database
18 rows affected.

[(2200, 2250),
 (2250, 2300),
 (2300, 2350),
 (2350, 2400),
 (2400, 2450),
 (2450, 2500),
 (2500, 2550),
 (2550, 2600),
 (2600, 2650),
 (2650, 2700),
 (2700, 2750),
 (2750, 2800),
 (2800, 2850),
 (2850, 2900),
 (2900, 2950),
 (2950, 3000),
 (3000, 3050),
 (3050, 3100)]

In [17]:
%%sql

WITH bins AS (
      SELECT generate_series(2200, 3050, 50) AS lower,
             generate_series(2250, 3100, 50) AS upper),
     -- Subset stackoverflow to just tag dropbox (Step 1)
     dropbox AS (
      SELECT question_count 
        FROM stackoverflow
       WHERE tag='dropbox') 
-- Select columns for result
-- What column are you counting to summarize?
SELECT lower, upper, count(question_count) 
  FROM bins  -- Created above
       -- Join to dropbox (created above), 
       -- keeping all rows from the bins table in the join
       LEFT JOIN dropbox
       -- Compare question_count to lower and upper
         ON question_count >= lower 
        AND question_count < upper
 -- Group by lower and upper to count values in each bin
 GROUP BY lower, upper
 -- Order by lower to put bins in order
 ORDER BY lower;

 * postgresql://postgres:***@localhost:5432/database
18 rows affected.

[(2200, 2250, 0),
 (2250, 2300, 0),
 (2300, 2350, 22),
 (2350, 2400, 39),
 (2400, 2450, 54),
 (2450, 2500, 53),
 (2500, 2550, 45),
 (2550, 2600, 41),
 (2600, 2650, 46),
 (2650, 2700, 57),
 (2700, 2750, 44),
 (2750, 2800, 50),
 (2800, 2850, 62),
 (2850, 2900, 61),
 (2900, 2950, 108),
 (2950, 3000, 159),
 (3000, 3050, 98),
 (3050, 3100, 44)]

### Correlation
`corr(col1,col2)`

### Median

### Percentile

`percentile_disc() WITHIN GROUP FROM 'tabl'`

In [18]:
%%sql
-- Correlation between revenues and profit
SELECT corr(revenues, profits) AS rev_profits,
	   -- Correlation between revenues and assets
       corr(revenues, assets) AS rev_assets,
       -- Correlation between revenues and equity
       corr(revenues, equity) AS rev_equity 
  FROM "Fortune500";

 * postgresql://postgres:***@localhost:5432/database
1 rows affected.

[(0.599993581572479, 0.329499521318506, 0.546570999718431)]

Compute the mean and median assets of Fortune 500 companies by sector.

In [19]:
%%sql
-- What groups are you computing statistics by?
SELECT sector,
       -- Select the mean of assets with the avg function
       avg(assets) AS mean,
       -- Select the median
       percentile_disc(0.5) WITHIN GROUP (ORDER BY assets) AS median
  FROM "Fortune500"
 -- Computing statistics for each what?
 GROUP BY sector
 -- Order results by a value of interest
 ORDER BY mean;

 * postgresql://postgres:***@localhost:5432/database
21 rows affected.

[('Engineering & Construction', Decimal('8199.2307692307692308'), 8709),
 ('Wholesalers', Decimal('9362.5862068965517241'), 5390),
 ('Materials', Decimal('10833.263157894737'), 7741),
 ('Apparel', Decimal('11064.8000000000000000'), 9739),
 ('Retailing', Decimal('14473.148936170213'), 7858),
 ('Hotels, Restaurants & Leisure', Decimal('16795.400000000000'), 14330),
 ('Business Services', Decimal('19626.100000000000'), 12485),
 ('Chemicals', Decimal('20151.214285714286'), 15769),
 ('Household Products', Decimal('23179.083333333333'), 10231),
 ('Food & Drug Stores', Decimal('24630.714285714286'), 17464),
 ('Transportation', Decimal('25922.000000000000'), 23286),
 ('Food, Beverages & Tobacco', Decimal('29059.750000000000'), 15984),
 ('Media', Decimal('30876.272727272727'), 22508),
 ('Aerospace & Defense', Decimal('31897.666666666667'), 20038),
 ('Industrials', Decimal('40117.684210526316'), 15201),
 ('Health Care', Decimal('42078.894736842105'), 25396),
 ('Technology', Decimal('48380.325581395349'), 17585),
 ('Energy', Decimal('48756.210526315789'), 36119),
 ('Motor Vehicles & Parts', Decimal('59443.111111111111'), 9901),
 ('Telecommunications', Decimal('114922.700000000000'), 30879),
 ('Financials', Decimal('319245.095238095238'), 123449)]

### Create a temp table

- Find the Fortune 500 companies that have profits in the top 20% for their sector (compared to other Fortune 500 companies).
- Then join fortune500 to the temporary table to select companies with profits greater than the 80th percentile cut-off.

In [20]:
%%sql
--## Find the Fortune 500 companies that have profits in the top 20% for their sector (compared to other Fortune 500 companies).
DROP TABLE IF EXISTS profit80;

CREATE TEMP TABLE profit80 AS

SELECT sector, 
         percentile_disc(0.8) WITHIN GROUP (ORDER BY profits) AS pct80
FROM "Fortune500" as fortune500
GROUP BY sector;

--## Join fortune500 to the temporary table to select companies with profits greater than the 80th percentile cut-off.
SELECT title, fortune500.sector, 
       profits, profits/pct80 AS ratio
-- What tables do you need to join?  
FROM "Fortune500" as fortune500
       LEFT JOIN profit80
-- How are the tables joined?
ON fortune500.sector=profit80.sector
-- What rows do you want to select?
WHERE Fortune500.profits > profit80.pct80
ORDER BY sector;

 * postgresql://postgres:***@localhost:5432/database
Done.
21 rows affected.
90 rows affected.

[('United Technologies', 'Aerospace & Defense', 5055.0, 1.03268641470889),
 ('Lockheed Martin', 'Aerospace & Defense', 5302.0, 1.08314606741573),
 ('Nike', 'Apparel', 3760.0, 3.50060515780654),
 ('S&P Global', 'Business Services', 2106.0, 1.50321199143469),
 ('Mastercard', 'Business Services', 4059.0, 2.89721627408994),
 ('Visa', 'Business Services', 5991.0, 4.2762312633833),
 ('ADP', 'Business Services', 1492.5, 1.06531049250535),
 ('Dow Chemical', 'Chemicals', 4318.0, 2.87866666666667),
 ('DuPont', 'Chemicals', 2513.0, 1.67533333333333),
 ('Dominion Energy', 'Energy', 2123.0, 1.61937452326468),
 ('Phillips 66', 'Energy', 1555.0, 1.186117467582),
 ('Valero Energy', 'Energy', 2289.0, 1.74599542334096),
 ('Duke Energy', 'Energy', 2152.0, 1.64149504195271),
 ('Enterprise Products Partners', 'Energy', 2513.1, 1.91693363844394),
 ('PPL', 'Energy', 1902.0, 1.45080091533181),
 ('Southern', 'Energy', 2448.0, 1.86727688787185),
 ('PG&E Corp.', 'Energy', 1393.0, 1.06254767353166),
 ('NextEra Energy', 'Energy', 2912.0, 2.22120518688024),
 ('Exxon Mobil', 'Energy', 7840.0, 5.98016781083143),
 ('Sempra Energy', 'Energy', 1370.0, 1.04500381388253),
 ('D.R. Horton', 'Engineering & Construction', 886.3, 1.47054919528787),
 ('Lennar', 'Engineering & Construction', 911.8, 1.51285880205741),
 ('BlackRock', 'Financials', 3172.0, 1.05242203052422),
 ('Freddie Mac', 'Financials', 7815.0, 2.592899800929),
 ('Fannie Mae', 'Financials', 12313.0, 4.08526874585269),
 ('Morgan Stanley', 'Financials', 5979.0, 1.98374253483743),
 ('Prudential Financial', 'Financials', 4368.0, 1.44923689449237),
 ('U.S. Bancorp', 'Financials', 5888.0, 1.9535500995355),
 ('Citigroup', 'Financials', 14912.0, 4.94757796947578),
 ('Goldman Sachs Group', 'Financials', 7398.0, 2.45454545454545),
 ('American Express', 'Financials', 5408.0, 1.79429329794293),
 ('Capital One Financial', 'Financials', 3751.0, 1.24452554744526),
 ('Bank of America Corp.', 'Financials', 17906.0, 5.94094226940942),
 ('J.P. Morgan Chase', 'Financials', 24733.0, 8.20603848706038),
 ('PNC Financial Services Group', 'Financials', 3903.0, 1.29495686794957),
 ('Wells Fargo', 'Financials', 21938.0, 7.27869940278699),
 ('Bank of New York Mellon', 'Financials', 3547.0, 1.17684140676841),
 ('Berkshire Hathaway', 'Financials', 24074.0, 7.98739216987392),
 ('Walgreens Boots Alliance', 'Food & Drug Stores', 4173.0, 2.0600286320778),
 ('Philip Morris International', 'Food, Beverages & Tobacco', 6967.0, 1.14720895768154),
 ('PepsiCo', 'Food, Beverages & Tobacco', 6329.0, 1.04215379548823),
 ('Altria Group', 'Food, Beverages & Tobacco', 14239.0, 2.34464021076898),
 ('Coca-Cola', 'Food, Beverages & Tobacco', 6527.0, 1.07475712168615),
 ('UnitedHealth Group', 'Health Care', 7017.0, 1.41329305135952),
 ('CVS Health', 'Health Care', 5317.0, 1.07089627391742),
 ('Johnson & Johnson', 'Health Care', 16540.0, 3.3313192346425),
 ('Pfizer', 'Health Care', 7215.0, 1.45317220543807),
 ('Gilead Sciences', 'Health Care', 13501.0, 2.71923464249748),
 ('AbbVie', 'Health Care', 5953.0, 1.19899295065458),
 ('Amgen', 'Health Care', 7722.0, 1.55528700906344),
 ('McDonalds', 'Hotels, Restaurants & Leisure', 4686.5, 2.8062874251497),
 ('Starbucks', 'Hotels, Restaurants & Leisure', 2817.7, 1.68724550898204),
 ('Procter & Gamble', 'Household Products', 10508.0, 4.85133887349954),
 ('Colgate-Palmolive', 'Household Products', 2441.0, 1.1269621421976),
 ('General Electric', 'Industrials', 8831.0, 2.38998646820027),
 ('Honeywell International', 'Industrials', 4809.0, 1.30148849797023),
 ('3M', 'Industrials', 5050.0, 1.36671177266576),
 ('International Paper', 'Materials', 904.0, 1.82258064516129),
 ('Weyerhaeuser', 'Materials', 1027.0, 2.07056451612903),
 ('Nucor', 'Materials', 796.3, 1.6054435483871),
 ('Disney', 'Media', 9391.0, 3.40871143375681),
 ('Time Warner', 'Media', 3926.0, 1.42504537205082),
 ('General Motors', 'Motor Vehicles & Parts', 9427.0, 2.05113141862489),
 ('Lowes', 'Retailing', 3093.0, 2.51872964169381),
 ('Dollar General', 'Retailing', 1251.1, 1.01881107491857),
 ('TJX', 'Retailing', 2298.2, 1.8714983713355),
 ('Walmart', 'Retailing', 13643.0, 11.1099348534202),
 ('Target', 'Retailing', 2737.0, 2.22882736156352),
 ('Home Depot', 'Retailing', 7957.0, 6.47964169381108),
 ('Costco', 'Retailing', 2350.0, 1.91368078175896),
 ('Liberty Interactive', 'Retailing', 1235.0, 1.0057003257329),
 ('AutoZone', 'Retailing', 1241.0, 1.01058631921824),
 ('Cisco Systems', 'Technology', 10739.0, 1.47797963115882),
 ('IBM', 'Technology', 11872.0, 1.63391136801541),
 ('Apple', 'Technology', 45687.0, 6.28777869529315),
 ('Intel', 'Technology', 10316.0, 1.41976328103496),
 ('Facebook', 'Technology', 10217.0, 1.40613817781448),
 ('Alphabet', 'Technology', 19478.0, 2.68070465180292),
 ('Microsoft', 'Technology', 16798.0, 2.31186347371318),
 ('Oracle', 'Technology', 8901.0, 1.22502064409579),
 ('AT&T', 'Telecommunications', 12976.0, 1.49235192639448),
 ('Verizon', 'Telecommunications', 13127.0, 1.50971822886717),
 ('Delta Air Lines', 'Transportation', 4373.0, 1.63415545590433),
 ('UPS', 'Transportation', 3431.0, 1.2821375186846),
 ('Union Pacific', 'Transportation', 4233.0, 1.58183856502242),
 ('AmerisourceBergen', 'Wholesalers', 1427.9, 2.35665951477141),
 ('McKesson', 'Wholesalers', 2258.0, 3.72668757220664),
 ('Genuine Parts', 'Wholesalers', 687.2, 1.13418055784783),
 ('Cardinal Health', 'Wholesalers', 1427.0, 2.3551741211421),
 ('Sysco', 'Wholesalers', 949.6, 1.56725532266051)]

### Create a temp table to simplify a query

- The Stack Overflow data contains daily question counts through 2018-09-25 for all tags, but each tag has a different starting date in the data.

- **Find out**
    - how many questions had each tag on the first date for which data for the tag is available, 
    - how many questions had the tag on the last day,
    - compute the difference between these two values.

#### To do:
- First compute the minimum date for each tag.
- Then use the minimum dates to select the question_count on both the first and last day.
    - join the temp table startdates to two different copies of the stackoverflow table: 
    - one for each column - first day 
    - and last day - aliased with different names.

In [21]:
%%sql

--## To clear table if it already exists
DROP TABLE IF EXISTS startdates;

--## create temp table to compute the minimum date for each tag. 
CREATE TEMP TABLE startdates AS
SELECT tag, min(date) AS mindate
  FROM stackoverflow
 GROUP BY tag;
 
-- # join the temp table startdates to two different copies of the stackoverflow(so_min & so_max) table:
SELECT startdates.tag, 
       mindate, 
       --## Select question count on the min and max days
       so_min.question_count AS min_date_question_count,
       so_max.question_count AS max_date_question_count,
        
       --## Compute the change in question_count (max- min)
       so_max.question_count - so_min.question_count AS change
        
FROM startdates
       
    --## Join startdates to stackoverflow with alias so_min
INNER JOIN stackoverflow AS so_min
    --## What needs to match between tables?
          ON startdates.tag = so_min.tag
         AND startdates.mindate = so_min.date
       
    --## Join to stackoverflow again with alias so_max
INNER JOIN stackoverflow AS so_max
         ON startdates.tag = so_max.tag
         AND so_max.date = '2018-09-25';

 * postgresql://postgres:***@localhost:5432/database
Done.
53 rows affected.
53 rows affected.

[('paypal', '2016-01-01', 13296, 18050, 4754),
 ('amazon-elb', '2016-09-01', 576, 1452, 876),
 ('amazon-mws', '2016-09-01', 367, 706, 339),
 ('amazon-swf', '2016-09-01', 167, 232, 65),
 ('amazon-sns', '2016-09-01', 690, 1400, 710),
 ('excel', '2016-01-01', 81384, 177603, 96219),
 ('mongodb', '2016-01-01', 55510, 104159, 48649),
 ('amazon-glacier', '2016-09-01', 118, 192, 74),
 ('amazon-route53', '2016-01-01', 369, 1098, 729),
 ('dropbox', '2016-01-01', 2319, 3071, 752),
 ('azure', '2016-01-01', 25859, 61259, 35400),
 ('sql-server', '2016-01-01', 151267, 242484, 91217),
 ('amazon-cloudwatch', '2016-09-01', 334, 1165, 831),
 ('amazon-redshift', '2016-09-01', 1448, 3502, 2054),
 ('amazon-cognito', '2016-09-01', 547, 2830, 2283),
 ('amazon-dynamodb', '2016-09-01', 2687, 5985, 3298),
 ('ios9', '2016-01-01', 3147, 4183, 1036),
 ('amazon-sqs', '2016-09-01', 855, 1584, 729),
 ('dropbox-api', '2016-01-01', 1437, 2072, 635),
 ('amazon-ses', '2016-09-01', 481, 934, 453),
 ('amazon-emr', '2016-09-01', 557, 3046, 2489),
 ('citrix', '2016-01-01', 465, 597, 132),
 ('amazon-elastic-beanstalk', '2016-09-01', 281, 5490, 5209),
 ('amazon-rds', '2016-09-01', 1156, 2537, 1381),
 ('amazon-rds-aurora', '2016-09-01', 60, 323, 263),
 ('android', '2016-01-01', 770606, 1138658, 368052),
 ('amazon-cloudformation', '2016-09-01', 592, 2516, 1924),
 ('ios', '2016-01-01', 397485, 577421, 179936),
 ('android-pay', '2017-03-17', 444, 490, 46),
 ('applepay', '2017-03-18', 222, 357, 135),
 ('windows', '2016-01-01', 88874, 124751, 35877),
 ('amazon-web-services', '2016-01-01', 22077, 63939, 41862),
 ('google-spreadsheet', '2016-01-01', 6531, 15685, 9154),
 ('amazon-cloudfront', '2016-01-01', 1099, 2264, 1165),
 ('amazon-lambda', '2016-09-01', 158, 8032, 7874),
 ('amazon-cloudsearch', '2016-01-01', 176, 318, 142),
 ('amazon-ecs', '2016-09-01', 145, 1074, 929),
 ('amazon-s3', '2016-01-01', 12015, 25443, 13428),
 ('amazon-elasticache', '2016-09-01', 257, 434, 177),
 ('amazon-simpledb', '2016-09-01', 374, 392, 18),
 ('amazon-data-pipeline', '2016-09-01', 195, 399, 204),
 ('amazon-ec2', '2016-01-01', 11632, 22755, 11123),
 ('amazon-ebs', '2016-09-01', 257, 338, 81),
 ('ios8', '2016-01-01', 9854, 9399, -455),
 ('amazon-kinesis', '2016-09-01', 259, 766, 507),
 ('cognos', '2016-01-01', 616, 848, 232),
 ('actionscript', '2016-01-01', 8761, 9101, 340),
 ('amazon', '2016-01-01', 2994, 3636, 642),
 ('osx', '2016-01-01', 62614, 87485, 24871),
 ('stripe-payments', '2016-01-01', 1736, 4964, 3228),
 ('actionscript-3', '2016-01-01', 39025, 41149, 2124),
 ('amazon-vpc', '2016-09-01', 339, 719, 380),
 ('applepayjs', '2017-03-18', 11, 30, 19)]

### Insert into a temp table

- by creating a temporary table and inserting rows into it.
- Compute the correlations between each pair of profits, profits_change, and revenues_change from the Fortune 500 data.

In [22]:
%%sql

DROP TABLE IF EXISTS correlations;

CREATE TEMP TABLE correlations AS
SELECT 'profits'::varchar AS measure,
       corr(profits, profits) AS profits,
       corr(profits, profits_change) AS profits_change,
       corr(profits, revenues_change) AS revenues_change
FROM "Fortune500";

-- Add a row for profits_change
-- Insert into what table?
INSERT INTO correlations
-- Follow the pattern of the select statement above
-- Using profits_change instead of profits
SELECT 'profits_change'::varchar AS measure,
       corr(profits_change, profits) AS profits,
       corr(profits_change, profits_change) AS profits_change,
       corr(profits_change, revenues_change) AS revenues_change
FROM "Fortune500";

-- Repeat the above, but for revenues_change
INSERT INTO correlations
SELECT 'revenues_change'::varchar AS measure,
       corr(revenues_change, profits) AS profits,
       corr(revenues_change, profits_change) AS profits_change,
       corr(revenues_change, revenues_change) AS revenues_change
FROM "Fortune500";

Select * from correlations limit 5;

 * postgresql://postgres:***@localhost:5432/database
Done.
1 rows affected.
1 rows affected.
1 rows affected.
3 rows affected.

[('profits', 1.0, 0.0153558542308577, 0.0179198358843361),
 ('profits_change', 0.0153558542308577, 1.0, -0.0916874769831917),
 ('revenues_change', 0.0179198358843361, -0.0916874769831917, 1.0)]

In [23]:
%%sql
-- Select each column, rounding the correlations
SELECT measure, 
       round(profits::numeric,2) AS profits,
       round(profits_change::numeric,2) AS profits_change,
       round(revenues_change::numeric,2) AS revenues_change
  FROM correlations;

 * postgresql://postgres:***@localhost:5432/database
3 rows affected.

[('profits', Decimal('1.00'), Decimal('0.02'), Decimal('0.02')),
 ('profits_change', Decimal('0.02'), Decimal('1.00'), Decimal('-0.09')),
 ('revenues_change', Decimal('0.02'), Decimal('-0.09'), Decimal('1.00'))]

In [24]:
df2= pd.read_csv('ev311.csv')
#df2.to_sql('evanston311',engine)

In [25]:
%%sql
SELECT * 
FROM evanston311 
LIMIT 3

 * postgresql://postgres:***@localhost:5432/database
3 rows affected.

[(0, 1340563, 'NONE', 'gov.publicstuff.com', 'Fire Prevention - Inspection of a Commercial Property', '2016-01-13T15:03:18Z', '2016-01-19T16:51:26Z', 'Sheridan Road', '606-612', 60202.0, 'Please contact Debbie at Ext. 222'),
 (1, 1826017, 'MEDIUM', 'Iframe', 'Water Service - Question or Concern', '2016-08-12T14:35:12Z', '2016-08-27T07:00:27Z', 'Washington St', '930', None, "Last spring we called you to report that our sump pump that in the past 50 years has been used to eject laundry water from the basement, was running  ... (771 characters truncated) ... This water is coming from somewhere, but our water bill suggests it is not an internal leak, as well as the other tests.  We thought you should know."),
 (2, 1849204, 'MEDIUM', 'Iframe', 'Trees-Fallen limb or tree', '2016-08-22T09:07:45Z', '2016-08-24T07:05:32Z', 'Lincoln St', '1183-1223', None, "This isn't about a fallen tree or tree limb but I didn't know how else to categorize it this.  The sidewalk on the north side of Lincoln Street, east ... (307 characters truncated) ...  there to make the sidewalk more useable, especially now that kids are back in school, walking on this sidewalk to/from Orrington and Haven.  Thanks!")]

In [26]:
%%sql
--## Find the 5 most common values of street and the count of each
SELECT street, count(*)
  FROM evanston311
 GROUP BY street
 ORDER BY count(*) DESC
 LIMIT 5;

 * postgresql://postgres:***@localhost:5432/database
5 rows affected.

[(None, 1699),
 ('Chicago Avenue', 1440),
 ('Sherman Avenue', 1276),
 ('Central Street', 1211),
 ('Davis Street', 1154)]

### Trimming
- Some of the street values in `evanston311` include `house numbers` with `#` or `/` in them. In addition, some street values end in a ..

- Remove 
    - the house numbers, 
    - extra punctuation, 
    - any spaces from the beginning 
    - end of the street values 

as a first attempt at cleaning up the values.

In [27]:
%%sql
SELECT distinct street,
       --## Trim off unwanted characters from street
       trim(street, '0123456789 #/.') AS cleaned_street
  FROM evanston311
 ORDER BY street
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/database
10 rows affected.

[('1/2 Chicago Ave', 'Chicago Ave'),
 ('1047B Chicago Ave', 'B Chicago Ave'),
 ('13th Street', 'th Street'),
 ('141A Callan Ave', 'A Callan Ave'),
 ('141b Callan Ave', 'b Callan Ave'),
 ('1624B Central St', 'B Central St'),
 ('217A Dodge Ave', 'A Dodge Ave'),
 ('221c Dodge Ave', 'c Dodge Ave'),
 ('300c Dodge Ave', 'c Dodge Ave'),
 ('3314A Central St', 'A Central St')]

### Exploring unstructured text

- The description column of `evanston311` has the details of the inquiry, while the `category` column groups inquiries into different types. 
- How well does the category capture what's in the description?
- What are the most frequent categories for such inquiries?

In [28]:
%%sql

--## Select categories containing Trash or Garbage
SELECT category
  FROM evanston311
WHERE category LIKE '%Trash%'
    OR category LIKE '%Garbage%'
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/database
10 rows affected.

[('Trash, Recycling, Yard Waste Cart- Repair/Replacement',),
 ('THIS REQUEST IS INACTIVE...Trash Cart - Compost Bin',),
 ('Trash - Tire Pickup',),
 ('Trash - Special Pickup - Resident Use',),
 ('Trash, Recycling, Yard Waste Cart- Repair/Replacement',),
 ('Trash - Missed Garbage Pickup',),
 ('THIS REQUEST IS INACTIVE...Trash Cart - Compost Bin',),
 ('Trash - Tire Pickup',),
 ('Trash - Missed Garbage Pickup',),
 ('Trash - Accumulation',)]

In [29]:
%%sql
-- Count rows with each category
SELECT category, count(*)
  FROM evanston311 
WHERE (description ILIKE '%trash%'
    OR description ILIKE '%garbage%') 
  AND category NOT LIKE '%Trash%'
  AND category NOT LIKE '%Garbage%'
-- What are you counting?
GROUP BY category
--- order by most frequent values
ORDER BY count DESC
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/database
10 rows affected.

[('Ask A Question / Send A Message', 273),
 ('Rodents- Rats', 77),
 ('Recycling - Missed Pickup', 28),
 ('Dead Animal on Public Property', 16),
 ('Graffiti', 15),
 ('Yard Waste - Missed Pickup', 14),
 ('Public Transit Agency Issue', 13),
 ('Food Establishment - Unsanitary Conditions', 13),
 ('Exterior Conditions', 10),
 ('Street Sweeping', 9)]

### Concatenate strings
House number `(house_num)` and `street` are in two separate columns in `evanston311`. Concatenate them together with a space in between the values.

In [30]:
%%sql

SELECT ltrim(concat(house_num, ' ', street)) AS address
  FROM evanston311
    LIMIT 10;

 * postgresql://postgres:***@localhost:5432/database
10 rows affected.

[('606-612 Sheridan Road',),
 ('930 Washington St',),
 ('1183-1223 Lincoln St',),
 ('1111 Callan Ave',),
 ('1524 Crain St',),
 ('2830 Central Street',),
 ('1139 Dodge Ave',),
 ('900 Oakton Street',),
 ('608 Oakton Street',),
 ('1320 Dewey Avenue',)]

### Split strings on a delimiter

The street suffix is the part of the street name that gives the type of street, such as Avenue, Road, or Street. In the Evanston 311 data, sometimes the street suffix is the full word, while other times it is the abbreviation.

Extract just the first word of each street value to find the most common streets regardless of the suffix.

Use `split_part(string_to_split, delimiter, part_number)`

In [31]:
%%sql
--# Select the first word of the street value
SELECT split_part(street, ' ', 1) AS street_name, 
       count(*)
  FROM evanston311
 GROUP BY street_name
 ORDER BY count DESC
 LIMIT 20;

 * postgresql://postgres:***@localhost:5432/database
20 rows affected.

[(None, 1699),
 ('Chicago', 1569),
 ('Central', 1529),
 ('Sherman', 1479),
 ('Davis', 1248),
 ('Church', 1225),
 ('Main', 880),
 ('Sheridan', 842),
 ('Ridge', 823),
 ('Dodge', 816),
 ('Maple', 778),
 ('Asbury', 675),
 ('Hinman', 586),
 ('West', 578),
 ('Orrington', 561),
 ('Emerson', 513),
 ('Grove', 498),
 ('Darrow', 489),
 ('Custer', 464),
 ('Lake', 444)]

### Shorten long strings

In [32]:
%%sql

--# Select the first 50 chars when length is greater than 50
SELECT CASE WHEN length(description) > 50
            THEN left(description, 50) || '...'
       -- otherwise just select description
       ELSE description
       END
  FROM evanston311
 --# limit to descriptions that start with the word I
 WHERE description LIKE 'I %'
 ORDER BY description
    LIMIT 10;

 * postgresql://postgres:***@localhost:5432/database
10 rows affected.

[('I  work for Schermerhorn & Co. and manage this con...',),
 ('I accidentally mistyped my license plate number - ...',),
 ('I accidentally sent the wrong cover letter on my a...',),
 ('I acquired c diff at north shore hospital in Evans...',),
 ('I am a 35 year resident of Evanston (314 Custer Av...',),
 ('I am a business owner at 1121 Emerson St at the co...',),
 ('I am a Cubs fan and watched game seven. But using ...',),
 ('I am a current customer at 1333 Maple Ave, Unit 2E...',),
 ('I am a day care worker at the family center at the...',),
 ('I am a Northwestern student that has accumulated t...',)]

## Strategies for multiple transformations
### Create an "other" category

## Group and recode values

In [33]:
%%sql
-- Code from previous step
DROP TABLE IF EXISTS recode;

CREATE TEMP TABLE recode AS
  SELECT DISTINCT category, 
         rtrim(split_part(category, '-', 1)) AS standardized
    FROM evanston311;
  
-- Update to group trash cart values
UPDATE recode 
   SET standardized='Trash Cart' 
 WHERE standardized LIKE 'Trash%Cart';

-- Update to group snow removal values
UPDATE recode
   SET standardized='Snow Removal' 
 WHERE standardized LIKE 'Snow%Removal%';
 
-- Examine effect of updates
SELECT DISTINCT standardized 
  FROM recode
 WHERE standardized LIKE 'Trash%Cart'
    OR standardized LIKE 'Snow%Removal%';

 * postgresql://postgres:***@localhost:5432/database
Done.
149 rows affected.
3 rows affected.
5 rows affected.
2 rows affected.

[('Snow Removal',), ('Trash Cart',)]

In [34]:
%%sql

-- Code from previous step
DROP TABLE IF EXISTS recode;

CREATE TEMP TABLE recode AS
  SELECT DISTINCT category, 
         rtrim(split_part(category, '-', 1)) AS standardized
  FROM evanston311;
UPDATE recode SET standardized='Trash Cart' 
 WHERE standardized LIKE 'Trash%Cart';
UPDATE recode SET standardized='Snow Removal' 
 WHERE standardized LIKE 'Snow%Removal%';
UPDATE recode SET standardized='UNUSED' 
 WHERE standardized IN ('THIS REQUEST IS INACTIVE...Trash Cart', 
               '(DO NOT USE) Water Bill',
               'DO NOT USE Trash', 'NO LONGER IN USE');
    
select * from recode limit 10;

 * postgresql://postgres:***@localhost:5432/database
Done.
149 rows affected.
3 rows affected.
5 rows affected.
4 rows affected.
10 rows affected.

[('Collection Boxes', 'Collection Boxes'),
 ('Animals - Too Many, Offensive, Odors, Unsanitary Messes', 'Animals'),
 ('Sewer-Poor Drainage', 'Sewer'),
 ('Post Office- Question or Concern', 'Post Office'),
 ('Pot Hole', 'Pot Hole'),
 ('Animal Service - Wilmette', 'Animal Service'),
 ('Traffic Signal/Traffic Signal Back Plate', 'Traffic Signal/Traffic Signal Back Plate'),
 ('Fire Prevention - Inspection of a Single Family Home', 'Fire Prevention'),
 ('Plastic Bag Ordinance - Question or Concern', 'Plastic Bag Ordinance'),
 ('Construction/Engineering', 'Construction/Engineering')]

In [35]:
%%sql
--# Select the recoded categories and the count of each
SELECT standardized, count(*)
--# From the original table and table with recoded values
  FROM evanston311 
       LEFT JOIN recode 
       -- What column do they have in common?
       ON evanston311.category = recode.category
 
 GROUP BY standardized
 --# Display the most common val values first
 ORDER BY count desc
 LIMIT 10;

 * postgresql://postgres:***@localhost:5432/database
10 rows affected.

[('Broken Parking Meter', 6092),
 ('Trash', 3699),
 ('Ask A Question / Send A Message', 2595),
 ('Trash Cart', 1902),
 ('Tree Evaluation', 1879),
 ('Rodents', 1305),
 ('Recycling', 1224),
 ('Dead Animal on Public Property', 1057),
 ('Child Seat Installation or Inspection', 1028),
 ('Fire Prevention', 880)]

### Create a table with indicator variables

- Determine whether medium and high priority requests in the evanston311 data are more likely to contain requesters' contact information: an email address or phone number.

    - Emails contain an @.
    - Phone numbers have the pattern of three characters, dash, three characters, dash, four characters. For example: 555-555-1212.

In [36]:
%%sql

-- To clear table if it already exists
DROP TABLE IF EXISTS indicators;

-- Create the indicators temp table
CREATE TEMP TABLE indicators AS
  -- Select id
  SELECT id, 
         --# Create the email indicator (find @)
         CAST (description LIKE '%@%' AS integer) AS email,
         --# Create the phone indicator
         CAST (description LIKE '%___-___-____%' AS integer) AS phone 
    
    FROM evanston311;

-- Inspect the contents of the new temp table
SELECT *
  FROM indicators
    LIMIT 10;

 * postgresql://postgres:***@localhost:5432/database
Done.
36431 rows affected.
10 rows affected.

[(1340563, 0, 0),
 (1826017, 0, 0),
 (1849204, 0, 0),
 (1880254, 0, 0),
 (1972582, 0, 1),
 (1840025, 0, 0),
 (2099219, 0, 0),
 (2554820, None, None),
 (1770749, 0, 0),
 (2129641, 0, 1)]

In [37]:
%%sql

SELECT priority,
       -- Compute the proportion of rows with each indicator
       sum(email)/count(*)::numeric AS email_prop, 
       sum(phone)/count(*)::numeric AS phone_prop
  
  FROM evanston311
       LEFT JOIN indicators
       -- Joining condition
       ON evanston311.id=indicators.id
 -- What are you grouping by?
 GROUP BY priority
    ;

 * postgresql://postgres:***@localhost:5432/database
4 rows affected.

[('MEDIUM', Decimal('0.01966927763272410792'), Decimal('0.01845082680591818973')),
 ('NONE', Decimal('0.00412220338419600412'), Decimal('0.00568465144110900568')),
 ('HIGH', Decimal('0.01136363636363636364'), Decimal('0.02272727272727272727')),
 ('LOW', Decimal('0.00580270793036750484'), Decimal('0.00193423597678916828'))]

## Working with dates and timestamps

In [38]:
%%sql
-- Select the category and the average completion time by category

SELECT category, 
       avg(date_completed::date - date_created::date) AS completion_time
  FROM evanston311
 GROUP BY category
-- Order the results
 ORDER BY completion_time desc
    limit 10;

 * postgresql://postgres:***@localhost:5432/database
10 rows affected.

[('Rodents- Rats', Decimal('64.4819923371647510')),
 ('Fire Prevention - Public Education', Decimal('34.6250000000000000')),
 ('Key Request - All  City Employees', Decimal('32.0000000000000000')),
 ('Smoking', Decimal('27.3333333333333333')),
 ('Notice of Violation', Decimal('24.1111111111111111')),
 ('Exterior Conditions', Decimal('23.8596491228070175')),
 ('General/Routine Maintenance - Facilities Management', Decimal('23.1600000000000000')),
 ('Trash - Special Pickup (STAFF ONLY)', Decimal('19.2718340611353712')),
 ('Public Transit Agency Issue', Decimal('19.0845070422535211')),
 ('Private Utility Service Issue', Decimal('17.8600000000000000'))]

#### How many requests are created in each of the 12 months during 2016-2017?

In [39]:
%%sql
SELECT DATE_PART('month', date_created::date) as month,
        count(*)
FROM evanston311
WHERE date_created >= '2016-01-01' 
  AND date_created < '2018-01-01'
 -- Group by what to get monthly counts?
GROUP BY month
    ORDER BY month;

 * postgresql://postgres:***@localhost:5432/database
12 rows affected.

[(1.0, 1811),
 (2.0, 1774),
 (3.0, 2171),
 (4.0, 2385),
 (5.0, 2674),
 (6.0, 3404),
 (7.0, 3063),
 (8.0, 3109),
 (9.0, 2760),
 (10.0, 2398),
 (11.0, 2283),
 (12.0, 2000)]

#### What is the most common hour of the day for requests to be created?

In [40]:
%%sql
-- Get the hour and count requests
SELECT date_part('hour', date_created::timestamp ) AS hour,
       count(*)
  FROM evanston311
 GROUP BY hour
 -- Order results to select most common
 ORDER BY count desc
    Limit 1;

 * postgresql://postgres:***@localhost:5432/database
1 rows affected.

[(9.0, 4089)]

#### During what hours are requests usually completed? Count requests completed by hour. Order the results by hour.

In [41]:
%%sql
--# Get the hour and count requests
SELECT date_part('hour', date_completed::timestamp ) AS hour,
       count(*)
  FROM evanston311
 GROUP BY hour
 --# Order results to select most common
 ORDER BY count desc
    Limit 5;

 * postgresql://postgres:***@localhost:5432/database
5 rows affected.

[(15.0, 5242), (14.0, 5059), (13.0, 4787), (12.0, 3580), (11.0, 3351)]

### Variation by day of week
Does the time required to complete a request vary by the day of the week on which the request was created?

In [42]:
%%sql

-- Select name of the day of the week the request was created 
SELECT to_char(date_created::date, 'day') AS day, 
       -- Select avg time between request creation and completion
       avg(date_completed::timestamp - date_created::timestamp) AS duration
  FROM evanston311 
 -- Group by the name of the day of the week and 
 -- integer value of day of week the request was created
 GROUP BY day, EXTRACT(DOW FROM date_created::date)
 -- Order by integer value of the day of the week 
 -- the request was created
 ORDER BY EXTRACT(DOW FROM date_created::date);

 * postgresql://postgres:***@localhost:5432/database
7 rows affected.

[('sunday   ', datetime.timedelta(days=9, seconds=6442, microseconds=572982)),
 ('monday   ', datetime.timedelta(days=7, seconds=3400, microseconds=41519)),
 ('tuesday  ', datetime.timedelta(days=7, seconds=10581, microseconds=726767)),
 ('wednesday', datetime.timedelta(days=7, seconds=43628, microseconds=185632)),
 ('thursday ', datetime.timedelta(days=7, seconds=37410, microseconds=633975)),
 ('friday   ', datetime.timedelta(days=8, seconds=38649, microseconds=25246)),
 ('saturday ', datetime.timedelta(days=7, seconds=52620, microseconds=356259))]

In [43]:
%%sql
-- Aggregate daily counts by month
SELECT date_trunc('month', day::date) AS month,
       avg(count)
  -- Subquery to compute daily counts
  FROM (SELECT date_trunc('day', date_created::date) AS day,
               count(*) AS count
          FROM evanston311
         GROUP BY day) AS daily_count
 GROUP BY month
 ORDER BY month;

 * postgresql://postgres:***@localhost:5432/database
30 rows affected.

[(datetime.datetime(2016, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('23.5161290322580645')),
 (datetime.datetime(2016, 2, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('30.7241379310344828')),
 (datetime.datetime(2016, 3, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('35.5483870967741935')),
 (datetime.datetime(2016, 4, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('37.3000000000000000')),
 (datetime.datetime(2016, 5, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('40.7666666666666667')),
 (datetime.datetime(2016, 6, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('44.0000000000000000')),
 (datetime.datetime(2016, 7, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('41.4838709677419355')),
 (datetime.datetime(2016, 8, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('46.5483870967741935')),
 (datetime.datetime(2016, 9, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('47.3333333333333333')),
 (datetime.datetime(2016, 10, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('35.8064516129032258')),
 (datetime.datetime(2016, 11, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('36.6206896551724138')),
 (datetime.datetime(2016, 12, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('29.3870967741935484')),
 (datetime.datetime(2017, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('34.9032258064516129')),
 (datetime.datetime(2017, 2, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('32.7037037037037037')),
 (datetime.datetime(2017, 3, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('35.6333333333333333')),
 (datetime.datetime(2017, 4, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('42.2000000000000000')),
 (datetime.datetime(2017, 5, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('46.8064516129032258')),
 (datetime.datetime(2017, 6, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('69.4666666666666667')),
 (datetime.datetime(2017, 7, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('57.3225806451612903')),
 (datetime.datetime(2017, 8, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('53.7419354838709677')),
 (datetime.datetime(2017, 9, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('44.6666666666666667')),
 (datetime.datetime(2017, 10, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('41.5483870967741935')),
 (datetime.datetime(2017, 11, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('40.7000000000000000')),
 (datetime.datetime(2017, 12, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('36.3000000000000000')),
 (datetime.datetime(2018, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('35.4827586206896552')),
 (datetime.datetime(2018, 2, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('30.5714285714285714')),
 (datetime.datetime(2018, 3, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('29.6774193548387097')),
 (datetime.datetime(2018, 4, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('35.1333333333333333')),
 (datetime.datetime(2018, 5, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('45.3548387096774194')),
 (datetime.datetime(2018, 6, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('44.4666666666666667'))]

## Aggregating with date/time series

#### Are there any days in the Evanston 311 data where no requests were created?

In [44]:
%%sql


SELECT day
--# Subquery to generate all dates
  FROM (SELECT generate_series(min(date_created::date),
                               max(date_created::date),
                               '1 day'::interval)::date AS day 
           FROM evanston311) AS all_dates
--# Select dates (day from above) that are NOT IN the subquery
 WHERE day NOT IN 
    
   --# Subquery to select all date_created values as dates
   (SELECT date_created::date
      FROM evanston311);

 * postgresql://postgres:***@localhost:5432/database
7 rows affected.

[(datetime.date(2016, 5, 8),),
 (datetime.date(2016, 11, 6),),
 (datetime.date(2017, 2, 5),),
 (datetime.date(2017, 3, 12),),
 (datetime.date(2017, 12, 25),),
 (datetime.date(2018, 1, 6),),
 (datetime.date(2018, 1, 14),)]

### Custom aggregation periods
Find the median number of Evanston 311 requests per day in each six month period from 2016-01-01 to 2018-06-30.

In [45]:
%%sql
-- Generate 6 month bins covering 2016-01-01 to 2018-06-30

-- Create lower bounds of bins
SELECT generate_series('2016-01-01',  -- First bin lower value
                       '2018-01-01',  -- Last bin lower value
                       '6 month'::interval) AS lower,
-- Create upper bounds of bins
       generate_series('2016-07-01',  -- First bin upper value
                       '2018-07-31',  -- Last bin upper value
                       '6 month'::interval) AS upper;

 * postgresql://postgres:***@localhost:5432/database
5 rows affected.

[(datetime.datetime(2016, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), datetime.datetime(2016, 7, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None))),
 (datetime.datetime(2016, 7, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), datetime.datetime(2017, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None))),
 (datetime.datetime(2017, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), datetime.datetime(2017, 7, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None))),
 (datetime.datetime(2017, 7, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), datetime.datetime(2018, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None))),
 (datetime.datetime(2018, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), datetime.datetime(2018, 7, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)))]

In [46]:
%%sql

-- Count number of requests made per day
SELECT day, count(date_created) AS count
-- Use a daily series from 2016-01-01 to 2018-06-30 
-- to include days with no requests
  FROM (SELECT generate_series('2016-01-01',  -- series start date
                               ' 2018-06-30',  -- series end date
                               '1 day'::interval)::date AS day) AS daily_series
       LEFT JOIN evanston311
       -- match day from above (which is a date) to date_created
       ON day = date_created::date
 GROUP BY day
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/database
10 rows affected.

[(datetime.date(2016, 1, 1), 5),
 (datetime.date(2016, 1, 2), 27),
 (datetime.date(2016, 1, 3), 8),
 (datetime.date(2016, 1, 4), 55),
 (datetime.date(2016, 1, 5), 33),
 (datetime.date(2016, 1, 6), 44),
 (datetime.date(2016, 1, 7), 35),
 (datetime.date(2016, 1, 8), 29),
 (datetime.date(2016, 1, 9), 17),
 (datetime.date(2016, 1, 10), 1)]

In [47]:
%%sql
-- Bins from Step 1
WITH bins AS (
	 SELECT generate_series('2016-01-01',
                            '2018-01-01',
                            '6 months'::interval) AS lower,
            generate_series('2016-07-01',
                            '2018-07-01',
                            '6 months'::interval) AS upper),
-- Daily counts from Step 2
     daily_counts AS (
     SELECT day, count(date_created) AS count
       FROM (SELECT generate_series('2016-01-01',
                                    '2018-06-30',
                                    '1 day'::interval)::date AS day) AS daily_series
            LEFT JOIN evanston311
            ON day = date_created::date
      GROUP BY day)
-- Select bin bounds 
SELECT lower, 
       upper, 
       -- Compute median of count for each bin
       percentile_disc(0.5) WITHIN GROUP (ORDER BY count) AS median
  -- Join bins and daily_counts
  FROM bins
       LEFT JOIN daily_counts
       -- Where the day is between the bin bounds
       ON day >= lower
          AND day < upper
 -- Group by bin bounds
 GROUP BY lower , upper
 ORDER BY lower;

 * postgresql://postgres:***@localhost:5432/database
5 rows affected.

[(datetime.datetime(2016, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), datetime.datetime(2016, 7, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 37),
 (datetime.datetime(2016, 7, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), datetime.datetime(2017, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 41),
 (datetime.datetime(2017, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), datetime.datetime(2017, 7, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 44),
 (datetime.datetime(2017, 7, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), datetime.datetime(2018, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 51),
 (datetime.datetime(2018, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), datetime.datetime(2018, 7, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 41)]

In [48]:
%%sql

--# generate series with all days from 2016-01-01 to 2018-06-30
WITH all_days AS 
     (SELECT generate_series('2016-01-01',
                             '2018-06-30',
                             '1 day'::interval) AS date),
     -- Subquery to compute daily counts
     daily_count AS 
     (SELECT date_trunc('day', date_created::date) AS day,
             count(*) AS count
        FROM evanston311
       GROUP BY day)
--# Aggregate daily counts by month using date_trunc
SELECT date_trunc('month', date) AS month,
       -- Use coalesce to replace NULL count values with 0
       avg(coalesce(count, 0)) AS average
  FROM all_days
       LEFT JOIN daily_count
       -- Joining condition
       ON all_days.date=daily_count.day
 GROUP BY month
 ORDER BY month;

 * postgresql://postgres:***@localhost:5432/database
30 rows affected.

[(datetime.datetime(2016, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('23.5161290322580645')),
 (datetime.datetime(2016, 2, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('30.7241379310344828')),
 (datetime.datetime(2016, 3, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('35.5483870967741935')),
 (datetime.datetime(2016, 4, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('37.3000000000000000')),
 (datetime.datetime(2016, 5, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('39.4516129032258065')),
 (datetime.datetime(2016, 6, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('44.0000000000000000')),
 (datetime.datetime(2016, 7, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('41.4838709677419355')),
 (datetime.datetime(2016, 8, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('46.5483870967741935')),
 (datetime.datetime(2016, 9, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('47.3333333333333333')),
 (datetime.datetime(2016, 10, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('35.8064516129032258')),
 (datetime.datetime(2016, 11, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('35.4000000000000000')),
 (datetime.datetime(2016, 12, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('29.3870967741935484')),
 (datetime.datetime(2017, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('34.9032258064516129')),
 (datetime.datetime(2017, 2, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('31.5357142857142857')),
 (datetime.datetime(2017, 3, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('34.4838709677419355')),
 (datetime.datetime(2017, 4, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('42.2000000000000000')),
 (datetime.datetime(2017, 5, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('46.8064516129032258')),
 (datetime.datetime(2017, 6, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('69.4666666666666667')),
 (datetime.datetime(2017, 7, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('57.3225806451612903')),
 (datetime.datetime(2017, 8, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('53.7419354838709677')),
 (datetime.datetime(2017, 9, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('44.6666666666666667')),
 (datetime.datetime(2017, 10, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('41.5483870967741935')),
 (datetime.datetime(2017, 11, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('40.7000000000000000')),
 (datetime.datetime(2017, 12, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('35.1290322580645161')),
 (datetime.datetime(2018, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('33.1935483870967742')),
 (datetime.datetime(2018, 2, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('30.5714285714285714')),
 (datetime.datetime(2018, 3, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), Decimal('29.6774193548387097')),
 (datetime.datetime(2018, 4, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('35.1333333333333333')),
 (datetime.datetime(2018, 5, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('45.3548387096774194')),
 (datetime.datetime(2018, 6, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), Decimal('44.4666666666666667'))]

In [49]:
%%sql

-- Compute the gaps
WITH request_gaps AS (
        SELECT date_created,
               -- lead or lag
               lag(date_created) OVER (ORDER BY date_created) AS previous,
               -- compute gap as date_created minus lead or lag
               date_created::date - lag(date_created::date) OVER (ORDER BY date_created) AS gap
          FROM evanston311)
-- Select the row with the maximum gap
SELECT *
  FROM request_gaps
-- Subquery to select maximum gap from request_gaps
 WHERE gap = (SELECT max(gap) 
                FROM request_gaps);

 * postgresql://postgres:***@localhost:5432/database
7 rows affected.

[('2016-05-09T07:25:14Z', '2016-05-07T20:04:50Z', 2),
 ('2016-11-07T08:39:25Z', '2016-11-05T18:06:21Z', 2),
 ('2017-02-06T07:07:46Z', '2017-02-04T19:53:56Z', 2),
 ('2017-03-13T05:58:15Z', '2017-03-11T16:16:20Z', 2),
 ('2017-12-26T01:56:34Z', '2017-12-24T20:49:51Z', 2),
 ('2018-01-07T18:41:34Z', '2018-01-05T18:04:09Z', 2),
 ('2018-01-15T07:13:05Z', '2018-01-13T19:42:15Z', 2)]

### Rats!

Requests in category "Rodents- Rats" average over 64 days to resolve. Why?

Investigate in 4 steps:

- Why is the average so high? Check the distribution of completion times. 
 
- See how excluding outliers influences average completion times.
 
- Do requests made in busy months take longer to complete? Check the correlation between the average completion time and requests per month.
 
- Compare the number of requests created per month to the number completed.

In [50]:
%%sql

--# Truncate the time to complete requests to the day
SELECT date_trunc('day', date_completed::timestamp -date_created::timestamp) AS completion_time,
-- Count requests with each truncated time
       count(*)
  FROM evanston311
WHERE category = 'Rodents- Rats'
GROUP BY completion_time
ORDER BY count
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/database
10 rows affected.

[(datetime.timedelta(days=348), 1),
 (datetime.timedelta(days=157), 1),
 (datetime.timedelta(days=161), 1),
 (datetime.timedelta(days=177), 1),
 (datetime.timedelta(days=190), 1),
 (datetime.timedelta(days=238), 1),
 (datetime.timedelta(days=283), 1),
 (datetime.timedelta(days=280), 1),
 (datetime.timedelta(days=286), 1),
 (datetime.timedelta(days=148), 1)]

In [51]:
%%sql
SELECT category, 
       --# Compute average completion time per category
       avg(date_completed::timestamp-date_created::timestamp) AS avg_completion_time
    FROM evanston311

--# Where completion time is less than the 95th percentile value
WHERE date_completed::timestamp-date_created::timestamp < 
--# Compute the 95th percentile of completion time in a subquery
         (SELECT percentile_disc(0.95) WITHIN GROUP (ORDER BY date_completed::timestamp-date_created::timestamp)
            FROM evanston311)
GROUP BY category
ORDER BY avg_completion_time DESC
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/database
10 rows affected.

[('Trash Cart - Downsize, Upsize or Remove', datetime.timedelta(days=12, seconds=64070, microseconds=586912)),
 ('Sanitation Billing Questions', datetime.timedelta(days=12, seconds=40405, microseconds=888889)),
 ('THIS REQUEST IS INACTIVE...Trash Cart - Compost Bin', datetime.timedelta(days=12, seconds=23562, microseconds=24390)),
 ('Trash, Recycling, Yard Waste Cart- Repair/Replacement', datetime.timedelta(days=11, seconds=67707, microseconds=488108)),
 ('Rodents- Rats', datetime.timedelta(days=11, seconds=32280, microseconds=840849)),
 ('Landmark Building Plaque or Nomination', datetime.timedelta(days=11, seconds=18671, microseconds=666667)),
 ('Notice of Violation', datetime.timedelta(days=10, seconds=70129, microseconds=142858)),
 ('Move Out- Special Pickup', datetime.timedelta(days=10, seconds=28620, microseconds=500000)),
 ('Long Term Care', datetime.timedelta(days=9, seconds=83529)),
 ('Smoking', datetime.timedelta(days=8, seconds=83706, microseconds=611111))]

In [52]:
%%sql

--# Compute correlation (corr) between avg_completion time and count from the subquery
SELECT corr(avg_completion, count)
  FROM (SELECT date_trunc('month', date_created::date) AS month, 
               -- Compute average completion time in number of seconds           
               avg(EXTRACT(epoch FROM date_completed::timestamp - date_created::timestamp)) AS avg_completion, 
               count(*) AS count
         FROM evanston311
         WHERE category='Rodents- Rats' 
         -- Group by month, created above
         GROUP BY month)
   AS monthly_avgs;

 * postgresql://postgres:***@localhost:5432/database
1 rows affected.

[(0.234379930623995,)]

In [53]:
%%sql

-- Compute monthly counts of requests created
WITH created AS (
       SELECT date_trunc('month', date_created::date) AS month,
              count(*) AS created_count
         FROM evanston311
        WHERE category='Rodents- Rats'
        GROUP BY month),
-- Compute monthly counts of requests completed
      completed AS (
       SELECT date_trunc('month', date_completed::date) AS month,
              count(*) AS completed_count
         FROM evanston311
        WHERE category='Rodents- Rats'
        GROUP BY month)
-- Join monthly created and completed counts
SELECT created.month, 
        created_count, 
       completed_count
  FROM created
       INNER JOIN completed
       ON created.month=completed.month
 ORDER BY created.month;

 * postgresql://postgres:***@localhost:5432/database
30 rows affected.

[(datetime.datetime(2016, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 11, 1),
 (datetime.datetime(2016, 2, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 21, 11),
 (datetime.datetime(2016, 3, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 31, 14),
 (datetime.datetime(2016, 4, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 36, 16),
 (datetime.datetime(2016, 5, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 40, 19),
 (datetime.datetime(2016, 6, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 41, 49),
 (datetime.datetime(2016, 7, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 80, 47),
 (datetime.datetime(2016, 8, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 79, 43),
 (datetime.datetime(2016, 9, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 56, 58),
 (datetime.datetime(2016, 10, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 76, 67),
 (datetime.datetime(2016, 11, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 63, 61),
 (datetime.datetime(2016, 12, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 20, 83),
 (datetime.datetime(2017, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 16, 34),
 (datetime.datetime(2017, 2, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 20, 30),
 (datetime.datetime(2017, 3, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 24, 32),
 (datetime.datetime(2017, 4, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 43, 14),
 (datetime.datetime(2017, 5, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 50, 17),
 (datetime.datetime(2017, 6, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 65, 34),
 (datetime.datetime(2017, 7, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 68, 46),
 (datetime.datetime(2017, 8, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 87, 53),
 (datetime.datetime(2017, 9, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 54, 70),
 (datetime.datetime(2017, 10, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 78, 12),
 (datetime.datetime(2017, 11, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 44, 174),
 (datetime.datetime(2017, 12, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 12, 65),
 (datetime.datetime(2018, 1, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 19, 45),
 (datetime.datetime(2018, 2, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 10, 10),
 (datetime.datetime(2018, 3, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 28, 27),
 (datetime.datetime(2018, 4, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 35, 23),
 (datetime.datetime(2018, 5, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 46, 47),
 (datetime.datetime(2018, 6, 1, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=120, name=None)), 52, 55)]